      subroutine tabl2(idensity,ros,ror,nt,day,mon,year,qq6t,KINrec,qq7r,qq7s,qq7t,qq5t,qq4t,qq3t,koxvoiltotal,koxvoilrec,KINproject,koxvwat,plast,lplast)

! koxvoil,koxvwat - текущие объемные коэффициенты охвата нефтенасыщенной и водонасыщенной областей
      character*10  plast
      character*4   year
      character*2   day,mon
      real*4        koxvoiltotal,koxvoilrec,KINrec,KINproject,koxvwat
      integer*2     nt,lplast
      
 ! Накопленная добытая нефть,тыс.т:
      c1=qq6t/1000.
 ! КИН текущий фактический:  
      c2=KINrec
 ! Текущие геологические запасы нефти,тыс.rm3:
      c3=qq7r/1000.
 ! Текущие геологические запасы нефти,тыс.sm3:
      c4=qq7s/1000.
! Текущие геологические запасы нефти,тыс.т:
      c5=qq7t/1000.
! Текущие извлекаемые (потенциально подвижные) запасы нефти,тыс.т:
      c6=qq5t/1000.
! Текущие недренируемые запасы нефти,тыс.т:            
      c7=qq4t/1000.
! Текушие дренируемые запасы нефти,тыс.т:               
      c8=qq3t/1000.
! Коэффициент охвата извлекаемых запасов нефти накопленный:
      c9=koxvoiltotal
! Коэффициент охвата извлекаемых запасов нефти текущий:
      c10=koxvoilrec
! КИН проектный c учетом текущего охвата:  
      c11=KINproject
! Охват вовлечения объемов воды  
      c12=koxvwat
      
!write(6,1)'============================================================================================================================================'
!write(6,1)' Nt |   Дата   | Добыто фактически |    Текущие геологические запасы   |         Текущие извл.запасы       |      Коэф.охвата      | Коэф.  '
!write(6,1)'    |          |___________________|___________________________________|___________________________________|_______________________| охвата '
!write(6,1)'    |          |           |       |                                   |           |  Охват воздействием:  |       |       |  КИН  |водонас.'
!write(6,1)'    |          |   Нефть   |  КИН  |               Всего               |   Всего   |Не охвачено| Охвачено  |накопл.|текущий|Прогноз|  зон   '
!write(6,1)'    |          |___________|_______|___________________________________|___________|___________|___________|_______|_______|_______|________'
!write(6,1)'    |          |   тыс.т   |  д.е. | Rm3*10**3 | Sm3*10**3 |   тыс.т   |   тыс.т   |   тыс.т   |   тыс.т   |  д.е. |  д.е. |  д.е. |  д.е.  '
!write(6,1)'============================================================================================================================================'
!                               c1        c2        c3          c4         c5           c6         c7            c8       c9      c10     c11     c12
      open(6,file='output_'//plast(1:lplast)//'.txt',position='append')   
      write(6,8) nt,' ',day,'.',mon,'.',year,c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12             
      close(6)
      
      open(6,file='output_'//plast(1:lplast)//'.excel',position='append')   
      write(6,9) nt,c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12             
      close(6)
      
 8    format(i5,a1,a2,a1,a2,a1,a4,f12.1,f8.4,f12.1,f12.1,f12.1,f12.1,f12.1,f12.1,f8.4,f8.4,f8.4,f8.4)                  
 9    format(i5,                  f12.1,f8.4,f12.1,f12.1,f12.1,f12.1,f12.1,f12.1,f8.4,f8.4,f8.4,f8.4)
 
      return                                                                
      end                                                                   
