      subroutine tabl1(k1,k2,ros,ror,roilgeo00,roilmob00,soilgeo00,roilgeo02,roilmob02,rwiipgeo0,vporsum,plast,lplast,imin,imax,jmin,jmax,idensity,nfluids,irotate,teta,fi)
      character*10 plast
      real*4       Kinend
      integer*2    k1,k2,lplast,imin,imax,jmin,jmax
            
! roilgeo00    - запасы нефти геологические начальные, тыс.rm3
      roilgeo01=roilgeo00/1000.
! roilgeo01   - запасы нефти геологические начальные, тыс.rm3

      soilgeo01=soilgeo00/1000.      
! soilgeo01   - запасы нефти геологические начальные, тыс.sm3

!      oilgeo02=roilgeo00*ror/1000./1000.
      oilgeo02=roilgeo02/1000./1000.
! oilgeo02   - запасы нефти геологические начальные, тыс.т

! roilmob00    - запасы подвижной нефти начальные, тыс.rm3 
      roilmob01=roilmob00/1000./1000.
! roilmob01   - запасы подвижной нефти начальные, тыс.rm3 
!      oilmob02=roilmob00*ror/1000./1000.
      oilmob02=roilmob02/1000./1000.
! oilmob02   - запасы подвижной нефти начальные, тыс.т
!
      if(oilgeo02.lt.0.000000001) then
        Kinend=0.
      else    
        Kinend=oilmob02/oilgeo02
      endif  
! Kinend - предельный КИН      

      open(6,file='output_'//plast(1:lplast)//'.txt')   
      write(6,1)'==========================================================================================================================================='
      write(6,2)'  Объект: ',plast(1:lplast),'. Слои модели: ',k1,' -',k2,', i= ',imin,' -',imax,', j= ',jmin,' -',jmax
      write(6,1)' ------------------------------------------------------------------------------------------------------------------------------------------'
      if(nfluids.eq.2) write(6,10)' Модель "нефть-вода"    '
      if(nfluids.eq.3) write(6,10)' Модель "нефть-вода-газ"'
      write(6,8)' Поворот карты по Y: ',irotate

      if(idensity.eq.1) then
        write(6,9)' Способ задания плотности нефти в пластовых условиях: среднее значение  '
      else
        write(6,9)' Способ задания плотности нефти в пластовых условиях: в каждом блоке    '
      endif

      write(6,4)' Объемный фактор = ',ros/ror
      write(6,3)' Плотность нефти в стандартных условиях = ',ros,' кг/м3'   
      write(6,3)' Плотность нефти в пластовых условиях   = ',ror,' кг/м3'
      write(6,5)' Поровый объем                  = ',vporsum/1000.,' тыс.rm3          '
      write(6,5)' Начальные запасы воды          =',rwiipgeo0/1000.,' тыс.rм3 (пл.усл.)'
      write(6,5)' Начальные геологические запасы =',roilgeo01,' тыс.rм3 (пл.усл.)'
      write(6,5)' Начальные геологические запасы =',soilgeo01,' тыс.sм3 (ст.усл.)'
      write(6,5)' Начальные геологические запасы =',oilgeo02,' тыс.т           ' 
      write(6,5)' Начальные подвижные     запасы =',oilmob02,' тыс.т           ' 
      write(6,7)' Технологический КИН (Кохв=1,исх.Квыт) =',kinend 
      write(6,11)' Параметры нелиненйости: сдвиг(тета)=',teta,' Доля адсорб.нефти=',fi
      write(6,1)'============================================================================================================================================='
      write(6,1)' Nt |   Дата   | Добыто фактически | Текущие геологические запасы нефти|     Текущие извл.запасы нефти     |Коэф.охвата извл.запасов| Коэф.  '
      write(6,1)'    |          |___________________|___________________________________|___________________________________|________________________| охвата '
      write(6,1)'    |          |           |       |                                   |           |  Охват воздействием:  |накопл.|       |  КИН   |водонас.'
      write(6,1)'    |          |   Нефть   |  КИН  |               Всего               |   Всего   |Не охвачено| Охвачено  |+ охват|текущий|Прогноз |объемов '
      write(6,1)'    |          |___________|_______|___________________________________|___________|___________|___________|_______|_______|________|________'
      write(6,1)'    |          |   тыс.т   |  д.е. | Rm3*10**3 | Sm3*10**3 |   тыс.т   |   тыс.т   |   тыс.т   |   тыс.т   |  д.е. |  д.е. |  д.е.  |  д.е.  '
      write(6,1)'============================================================================================================================================='
      
      close(6) 
     
 1    format(a140) 
 2    format(a10,a<lplast>,a15,i4,a2,i4,a5,i4,a2,i4,a5,i4,a2,i4)
 3    format(a42,f9.3,a6)
 4    format(a19,f7.4)
 5    format(a33,f18.3,a18)
 6    format(a21,f10.1,a6)
 7    format(a40,f7.4)
 8    format(a21,i2)
 9    format(a72)
10    format(a24)
11    format(a37,f11.1,a19,f9.6) 
      return                                                                
      end                                                                   
